app/controllers/school_classes_controller.rb

  def create
    @school_class = SchoolClass.create(params[:school_class])
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2018-07-24 22:35:55.442700"], ["updated_at", "2018-07-24 22:35:55.442700"]]

  def show
    # binding.pry
    @school_class = SchoolClass.find(params[:id])
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @school_class = SchoolClass.find(params[:id])
    @school_class.update(params.require(:student_class))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-07-25 00:16:24.018008"], ["id", 1]]