app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2018-07-24 23:10:12.285623"], ["updated_at", "2018-07-24 23:10:12.285623"]]
---
  def create
    # binding.pry
    @student = Student.create(first_name: params[:student][:first_name], last_name: params[:student][:last_name])

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    # binding.pry
    @student = Student.find(params[:id])